# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'ldez/tap'
tap 'sigstore/tap'
tap 'homeport/tap' # dyff
tap 'buildpacks/tap'
tap 'homebrew/cask-fonts'         # You only need to do this once!

# Fonts
cask 'font-meslo-lg-nerd-font'

# System tools
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'less'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'parallel'
brew 'screen'
brew 'ncurses'
brew 'pv'
brew 'shfmt'
brew 'ncdu'
brew 'dust'
brew 'z'
brew 'exa'
brew 'defaultbrowser'

# Development & Power Tools
cask 'iterm2'
cask 'warp'
cask 'android-studio'
cask 'visual-studio-code'
cask 'postman'
cask 'goland'
cask 'dbeaver-community'
cask 'azure-data-studio'
cask 'pgadmin4'
cask 'menumeters'
cask 'ngrok'
cask 'wireshark'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack'
brew 'ccat'
brew 'bat'
brew 'icdiff'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git-delta'
brew 'dyff'
brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'gitsign'
brew 'gh'
brew 'hg'
brew 'git-interactive-rebase-tool'
brew 'gti'
brew 'prm'
brew 'go'
brew 'fzf'
brew 'jq'
brew 'jless'
brew 'node'
brew 'yarn'
brew 'rbenv'
brew 'ruby'
brew 'python3'
brew 'openssl'
brew 'openssh'
brew 'openvpn'
brew 'protobuf'
brew 'prototool'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'fd'
brew 'wdiff'
brew 'entr'
brew 'direnv'
brew 'bats-core'
brew 'tldr'
brew 'shellcheck'
brew 'telnet'
brew 'mitmproxy'
brew 'fortio'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'exiftool'
brew 'jmeter'

# Commit signing
brew 'pinentry-mac'
brew 'gnupg'
cask 'keybase'

# Containers
brew 'kubernetes-cli'
brew 'helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'minikube'
brew 'kind'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
cask 'docker' # docker for desktop
brew 'ko'
brew 'dive'
brew 'crane'
brew 'cosign'
brew 'pack'
brew 'terraform'
brew 'orbstack'

# Fun tools
brew 'asciinema'
brew 'lolcat'

# Desktop Software
cask 'clipy'
cask 'zoom'
cask 'muzzle'
cask 'microsoft-teams'
cask 'flux'
cask 'slack'
cask 'skype'
cask 'rectangle'
cask 'monitorcontrol'
cask 'spotify'
cask '1password'
cask 'firefox'
cask 'brave-browser'
cask 'chromedriver'
cask 'chromium'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'open-in-code'
cask 'bitbar'
cask 'discord'
cask 'whatsapp'
cask 'telegram'
cask 'flameshot'
cask 'anydesk'
cask 'drawio'
cask 'microsoft-office'
cask 'logi-options-plus'
cask 'android-file-transfer'
cask 'the-unarchiver'
cask 'osquery'

# Streaming software
cask 'obs'
cask 'loopback'
cask 'shureplus-motiv'
cask 'vlc'

# Cloud providers
cask 'google-cloud-sdk'
brew 'awscli'
brew 'aws-amplify'
cask 'aws-vault'
brew 'azure-cli'
